import pandas as pd

import _00_Common

time_index = pd.date_range('01/01/2022', periods=12, freq='M')
dataframe = pd.DataFrame(index=time_index)
dataframe['stockprice'] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 ]
print(dataframe)
print()
'''
                stockprice
2022-01-31           1
2022-02-28           2
2022-03-31           3
2022-04-30           4
2022-05-31           5
2022-06-30           6
2022-07-31           7
2022-08-31           8
2022-09-30           9
2022-10-31          10
2022-11-30          11
2022-12-31          12
'''

# 단순 이동 평균 -- 이전 데이터와 현재 데이터의 가중치가 동일 : 단순 이동 평균
print("--- 단순 이동 평균 -- 이전 데이터와 현재 데이터의 가중치가 동일 : 단순 이동 평균 ---")
print(dataframe.rolling(window=2).mean())
print()
'''
                stockprice
2022-01-31         NaN
2022-02-28         1.5
2022-03-31         2.5
2022-04-30         3.5
2022-05-31         4.5
2022-06-30         5.5
2022-07-31         6.5
2022-08-31         7.5
2022-09-30         8.5
2022-10-31         9.5
2022-11-30        10.5
2022-12-31        11.5
'''

# 지수 이동 평균 : 이전 데이터의 가중치를 줄여서 반영
print("지수 이동 평균 : 이전 데이터의 가중치를 줄여서 반영, span = 3 ")
print(dataframe.ewm(span=3).mean())
print()
'''
지수 이동 평균 : 이전 데이터의 가중치를 줄여서 반영, span = 3 
            stockprice
2022-01-31    1.000000
2022-02-28    1.666667
2022-03-31    2.428571
2022-04-30    3.266667
2022-05-31    4.161290
2022-06-30    5.095238
2022-07-31    6.055118
2022-08-31    7.031373
2022-09-30    8.017613
2022-10-31    9.009775
2022-11-30   10.005374
2022-12-31   11.002930
'''

print("지수 이동 평균 : 이전 데이터의 가중치를 줄여서 반영, span = 10 ")
print(dataframe.ewm(span=10).mean())
print()
'''
지수 이동 평균 : 이전 데이터의 가중치를 줄여서 반영, span = 10 
            stockprice
2022-01-31    1.000000
2022-02-28    1.550000
2022-03-31    2.132890
2022-04-30    2.748020
2022-05-31    3.394502
2022-06-30    4.071240
2022-07-31    4.776953
2022-08-31    5.510212
2022-09-30    6.269468
2022-10-31    7.053089
2022-11-30    7.859394
2022-12-31    8.686679
'''